__author__ = 'Искендеров Рустам Эльдарович'

# Задача-4:
# Даны четыре точки А1(х1, у1), А2(x2 ,у2), А3(x3 , у3), А4(х4, у4).
# Определить, будут ли они вершинами параллелограмма.

import math

a1 = (0, 10)
a2 = (3, 20)
a3 = (18, 20)
a4 = (15, 10)

def otrezok(a, b):
    """
    Функция вычисляет длину отрезка по заданным координатам по теореме Пифагора |AB|² = (y2 - y1)² + (x2 - x1)²
    """
    return math.sqrt((b[1] - a[1]) ** 2 + (b[0] - a[0]) ** 2)

ab = otrezok(a1, a2)
bc = otrezok(a2, a3)
ac = otrezok(a1, a3)
bd = otrezok(a2, a4)

# Определяем по признаку параллелограмма AC^2 + BD^2 = 2AB^2 + 2BC^2
if ac ** 2 + bd ** 2 == 2 * ab ** 2 + 2 * bc ** 2:
    print('true')
else:
    print('false')

